app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student).permit(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Josh"], ["updated_at", "2019-05-31 18:18:05.535946"], ["id", 1]]